// stdafx.h: включаемый файл для стандартных системных включаемых файлов
// или включаемых файлов для конкретного проекта, которые часто используются, но
// не часто изменяются
//

#pragma once					// Директива, которая предотвращает повторные подключения h-файлов
#include <math.h>			// математических функций
#include <locale.h>	// функций, устанавливающих национальные кодировки символов
#include <iostream>	// Эта - часть библиотеки STL (Standard Template Library)
#include <limits>			// Полезные константы
#include <windows.h>
#include <conio.h>
using namespace std;		// Обеспечивает видимость имен STL
#define stop __asm nop// Эта макроподстановка упрощает установку точек останова


// TODO: Установите здесь ссылки на дополнительные заголовки, требующиеся для программы
